УТ.УчетЗадач/src/Catalogs/cbr_Календарь/cbr_Календарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_Календарь</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесьДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПовторения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПовторения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПриглашения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовторения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторениеПоДнямМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторениеПоМесяцам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОкончанияПовторения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Связанная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйПредмет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.cbr_СостояниеЗаписиРабочегоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаписиКалендаря</name>
    <type>
      <types>EnumRef.cbr_ТипЗаписиКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаПовторения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭффективныеЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключенияПовторения</name>
    <attributes>
      <name>ДатаИсключения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьИсключения</name>
      <type>
        <types>CatalogRef.cbr_Календарь</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПовторениеПоДням</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВхождения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.УчетЗадач/src/Enums/cbr_ПериодОтображенияРабочегоКалендаря/cbr_ПериодОтображенияРабочегоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ПериодОтображенияРабочегоКалендаря</name>
  <enumValues>
    <name>ДвеНедели</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>ТриДня</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>НеделяСТекущейДаты</name>
  </enumValues>
  <enumValues>
    <name>ПланДня</name>
  </enumValues>
  <enumValues>
    <name>ПланДняДень</name>
  </enumValues>
  <enumValues>
    <name>ПланДняРабочийСтол</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Catalogs/cbr_Календарь/Forms/Календарь/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	ОтображаемаяДата = НачалоДня(ТекущаяДатаСеанса());
	ПериодОтображения = cbr_КалендарьСервер.ПолучитьПерсональнуюНастройку(
		"ПериодОтображенияРабочегоКалендаря");

	ОтображатьЛегенду = cbr_КалендарьСервер.ПолучитьПерсональнуюНастройку(
		"ОтображатьЛегенду");

	УстановитьВариантРаботыФормы();
	ОбновитьОтображениеСервер();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ДатаСегодня = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());

	УстановитьДоступностьЭлементов();
	УстановитьОтображаемуюДату(ОтображаемаяДата);

	УстановитьАвтообновлениеФормы();
	
	cbr_КалендарьКлиент.ОбработкаПриАктивизации(Элементы.Планировщик, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_ЗаписьКалендаря" Тогда

		Если Источник = УникальныйИдентификатор Тогда
			Возврат;
		КонецЕсли;

		Если ТипЗнч(Параметр) = Тип("Массив") Тогда
			Если Параметр.Количество() <> 0 Тогда
				ТекущаяЗаписьКалендаря = Параметр[0];
				ТекущаяДатаНачала = Неопределено;
			КонецЕсли;
		КонецЕсли;

		ОбновитьОтображениеКлиент(Параметр);

	КонецЕсли;

	Если ИмяСобытия = "Запись_ДоступноеВремяФизЛица" Или ИмяСобытия = "Запись_ЗанятостьФизЛица" Или ИмяСобытия = "Запись_Мероприятие"
		Или ИмяСобытия = "Запись_Отсутствие" Или ИмяСобытия = "Закрытие_НастройкиСинхронизацииКалендаря" Тогда

		ОбновитьОтображениеКлиент();

	КонецЕсли;

	Если ИмяСобытия = "Запись_НастройкиКалендаря" Тогда
		ОбновитьОтображениеКлиент( , , Истина);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтображатьДействуюшиеЗадачиПриИзменении(Элемент)
	ОбновитьНастройкиОтображения();
	cbr_КалендарьСервер.ОтобразитьКалендарь(Планировщик, НастройкиОтображения);
КонецПроцедуры

&НаКлиенте
Процедура НадписьПериодНажатие(Элемент)

	ИзменитьВидимостьВыбораДаты();

КонецПроцедуры

&НаКлиенте
Процедура ПериодОтображенияПриИзменении(Элемент)

	УстановитьОтображаемуюДату(ОтображаемаяДата);

	ОбновитьДанныеКалендаря("ПериодОтображения");
	УстановитьДоступностьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемаяДатаПриИзменении(Элемент)

	ВыделенныеДаты.ЗагрузитьЗначения(Элемент.ВыделенныеДаты);
	ОбновитьНастройкиОтображения();

	ОбновитьДанныеКалендаря();

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемаяДатаПриАктивизацииДаты(Элемент)

	Если Элемент.ВыделенныеДаты.Количество() = ВыделенныеДаты.Количество() Тогда
		Возврат;
	КонецЕсли;

	ВыделенныеДаты.ЗагрузитьЗначения(Элемент.ВыделенныеДаты);
	Если ВыделенныеДаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если ВыделенныеДаты.НайтиПоЗначению(ОтображаемаяДата) = Неопределено Тогда
		ОтображаемаяДата = ВыделенныеДаты[ВыделенныеДаты.Количество() - 1].Значение;
	КонецЕсли;
	ОбновитьНастройкиОтображения();

	ОбновитьДанныеКалендаря("ПериодОтображения");

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемаяДатаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, ВыбраннаяДата)

	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыПеретаскивания.Значение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("ЭлементПланировщика") Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Структура") Тогда
		Если (Не cbr_КаленарьКлиентСервер.ЭтоЭлементЗаписиКалендаря(ПараметрыПеретаскивания.Значение[0])) = Ложь Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтображаемаяДатаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, ВыбраннаяДата)

	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыПеретаскивания.Значение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("ЭлементПланировщика") Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("Структура") Тогда

		Если Не cbr_КаленарьКлиентСервер.ЭтоЭлементЗаписиКалендаря(
				ПараметрыПеретаскивания.Значение[0]) Тогда
			Возврат;
		КонецЕсли;

		СтандартнаяОбработка = Ложь;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФизЛицаКалендаряПриИзменении(Элемент)

	ОбновитьНастройкиОтображения();
	ЗавершениеВыбратьКалендарьСотрудникаСервер();

КонецПроцедуры

#Область ОбработчикиСобытийКалендаря

&НаКлиенте
Процедура ПланировщикПриАктивизации(Элемент, СтандартнаяОбработка)

	cbr_КалендарьКлиент.ОбработкаПриАктивизации(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	cbr_КалендарьКлиент.ОбработкаПередСозданием(
		Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка, ИспользоватьБыстроеРедактирование,
		ПолучениеФизлицаКалендаря(ФизЛицоКалендаря, Значения), НастройкиОтображения, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикВыбор(Элемент, СтандартнаяОбработка)

	cbr_КалендарьКлиент.ОбработкаВыбораЭлемента(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)

	cbr_КалендарьКлиент.ОбработкаПередУдалениемЭлемента(Элемент, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)

	cbr_КалендарьКлиент.ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	cbr_КалендарьКлиент.ОбработкаОкончанияРедактированияЭлемента(
		Элемент, НовыйЭлемент, ОтменаРедактирования,
		Планировщик, НастройкиОтображения, УникальныйИдентификатор, ФизЛицоКалендаря);
	ОбновитьОтображениеКлиент();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьКалендарь(Команда)

	ОбновитьОтображениеКлиент();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиКалендаря(Команда)

	ОткрытьФорму("Справочник.cbr_Календарь.Форма.НастройкиКалендаря");

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПредыдущийПериод(Команда)

	УстановитьОтображаемуюДату(
		cbr_КаленарьКлиентСервер.ПолучитьДатуНачалаПредыдущегоПериода(
			ПериодОтображения, ОтображаемаяДата));

	ОбновитьДанныеКалендаря();

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСегодня(Команда)

	УстановитьОтображаемуюДату(ОбщегоНазначенияКлиент.ДатаСеанса());

	ОбновитьДанныеКалендаря();

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСледующийПериод(Команда)

	УстановитьОтображаемуюДату(
		cbr_КаленарьКлиентСервер.ПолучитьДатуНачалаСледующегоПериода(
			ПериодОтображения, ОтображаемаяДата));

	ОбновитьДанныеКалендаря();

КонецПроцедуры

&НаКлиенте
Процедура СкрытьЛегенду(Команда)

	СкрытьЛегендуСервер();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписьКалендаря(Команда)

	Если ПериодОтображения = ПредопределенноеЗначение("Перечисление.cbr_ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда
		cbr_КалендарьКлиент.СоздатьЗаписьКалендаряПланДня(
			Элементы.ПланДня, НастройкиОтображения, ФизЛицоКалендаря);
	Иначе
		cbr_КалендарьКлиент.СоздатьЗаписьКалендаряПланировщик(
			НастройкиОтображения, ФизЛицоКалендаря);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучениеФизлицаКалендаря(ФизЛицоКалендаря, Значения)
	Возврат ?(ФизЛицоКалендаря = Справочники.Пользователи.ПустаяСсылка(), Значения["ФизическоеЛицо"], ФизЛицоКалендаря);
КонецФункции

&НаСервере
Процедура ЗавершениеВыбратьКалендарьСотрудникаСервер()

	cbr_КалендарьСервер.УстановитьПерсональнуюНастройку(
		"ТекущиеКалендариВсеКалендари", ФизЛицаКалендаря.ВыгрузитьЗначения());
	ОбновитьОтображениеСервер();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()

	Элементы.ГруппаЛегенда.Видимость = ОтображатьЛегенду;

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()

	Если ПериодОтображения = ПредопределенноеЗначение("Перечисление.cbr_ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда

		Элементы.ГруппаОписаниеЛегенды.Доступность = Ложь;

	Иначе

		Элементы.ГруппаОписаниеЛегенды.Доступность = cbr_КаленарьКлиентСервер.ПолучитьОтобразитьЗанятостьВДне(
			НастройкиОтображения);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СкрытьЛегендуСервер()

	ОтображатьЛегенду = Ложь;
	cbr_КалендарьСервер.УстановитьПерсональнуюНастройку("ОтображатьЛегенду", Ложь);
	УстановитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьАвтообновлениеФормы()

	Если ТипЗнч(НастройкиАвтообновления) = Тип("Структура") И НастройкиАвтообновления.Автообновление Тогда
		ПодключитьОбработчикОжидания(
			"ОбработкаАвтообновления", НастройкиАвтообновления.ПериодАвтоОбновления, Ложь);
	Иначе
		ОтключитьОбработчикОжидания("ОбработкаАвтообновления");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАвтообновления()

	Если ТипЗнч(НастройкиАвтообновления) <> Тип("Структура") Или (ТипЗнч(НастройкиАвтообновления) = Тип("Структура")
		И Не НастройкиАвтообновления.Автообновление) Тогда
		ОтключитьОбработчикОжидания("ОбработкаАвтообновления");
	Иначе

		Если ПериодОтображения = ПредопределенноеЗначение(
			"Перечисление.cbr_ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда

			ОбновитьОтображениеКлиент();

		Иначе

			ОбновитьДанныеКалендаря();

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображаемуюДату(НоваяОтображаемаяДата)

	Элементы.ОтображаемаяДата.ВыделенныеДаты.Очистить();
	ОтображаемаяДата = НоваяОтображаемаяДата;
	Элементы.ОтображаемаяДата.ВыделенныеДаты.Добавить(ОтображаемаяДата);
	ВыделенныеДаты.ЗагрузитьЗначения(Элементы.ОтображаемаяДата.ВыделенныеДаты);

	ОбновитьНастройкиОтображения();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКлиент(Параметр = Неопределено, ИзмененнаяНастройка = Неопределено,
	ОбновитьНастройки = Ложь)

	ДатаСегодня = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());

	Если Параметр <> Неопределено И ПериодОтображения <> ПредопределенноеЗначение(
		"Перечисление.cbr_ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда

		cbr_КалендарьКлиент.ОбновитьЗаписиКалендаряВПланировщике(
			Планировщик, НастройкиОтображения, Параметр);

		Возврат;

	КонецЕсли;

	СвернутыеЭлементы = cbr_КалендарьКлиент.ПолучитьСвернутыеЭлементыПланаДня(
		Элементы.ПланДня, ПланДня);
	ОбновитьОтображениеСервер(Параметр, ИзмененнаяНастройка, ОбновитьНастройки);
	cbr_КалендарьКлиент.ВосстановитьСостояниеПланаДня(
		Элементы.ПланДня, ПланДня, СвернутыеЭлементы, ТекущаяЗаписьКалендаря, ТекущаяДатаНачала);

	Если ОбновитьНастройки Тогда
		УстановитьАвтообновлениеФормы();
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ОбновитьДанныеКалендаря(ИзмененнаяНастройка = Неопределено)

	Если ПериодОтображения = ПредопределенноеЗначение("Перечисление.cbr_ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда
		ОбновитьОтображениеКлиент( , ИзмененнаяНастройка);
	Иначе
		cbr_КалендарьКлиент.ОбновитьОтображениеПланировщика(
			Планировщик, НастройкиОтображения, ИзмененнаяНастройка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеСервер(Параметр = Неопределено, ИзмененнаяНастройка = Неопределено,
	ОбновитьНастройки = Ложь)

	cbr_КалендарьСервер.СохранитьНастройку(НастройкиОтображения, ИзмененнаяНастройка);

	НастройкиОтображения = cbr_КалендарьСервер.ПолучитьНастройкиОтображения();
	НастройкиОтображения.ФизЛица.Очистить();
	Для Каждого ОчередноеФизЛицо Из ФизЛицаКалендаря Цикл
		НастройкиОтображения.ФизЛица.Добавить(ОчередноеФизЛицо.Значение);
	КонецЦикла;
	Если ФизЛицаКалендаря.Количество() = 1 Тогда
		ФизЛицоКалендаря = ФизЛицаКалендаря[0].Значение;
	Иначе
		ФизЛицоКалендаря = Неопределено;
	КонецЕсли;
	НастройкиОтображения.ОтображаемаяДата = ОтображаемаяДата;
	НастройкиОтображения.ВыделенныеДаты = ВыделенныеДаты.ВыгрузитьЗначения();
	НастройкиОтображения.ПериодОтображения = ПериодОтображения;
	НастройкиОтображения.ОтображатьДействующиеЗадачи = ОтображатьДействуюшиеЗадачи;
	УстановитьТекущуюСтраницу(Элементы, ФизЛицаКалендаря, ПериодОтображения);

	Если ПериодОтображения = Перечисления.cbr_ПериодОтображенияРабочегоКалендаря.ПланДня Тогда

		ПланДняЗначение = РеквизитФормыВЗначение("ПланДня");
		cbr_КалендарьСервер.ОтобразитьПланДня(ПланДняЗначение, НастройкиОтображения);
		ЗначениеВРеквизитФормы(ПланДняЗначение, "ПланДня");

	Иначе

		cbr_КалендарьСервер.ОтобразитьКалендарь(Планировщик, НастройкиОтображения);

		ИспользоватьБыстроеРедактирование = cbr_КалендарьСервер.ПолучитьПерсональнуюНастройку(
					"ИспользоватьБыстроеРедактирование");

		УстановитьВидимостьЭлементов();

	КонецЕсли;

	Если ОбновитьНастройки Тогда
		ОтображатьЛегенду = cbr_КалендарьСервер.ПолучитьПерсональнуюНастройку("ОтображатьЛегенду");
		УстановитьВидимостьЭлементов();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВариантРаботыФормы()

	Если Не ЗначениеЗаполнено(Параметры.ВариантРаботыФормы) Тогда
		Параметры.ВариантРаботыФормы = "ВсеКалендари";
	КонецЕсли;

	Если Параметры.ВариантРаботыФормы = "ВсеКалендари" Тогда
		КлючНазначенияИспользования = "ВсеКалендари";
		Заголовок = НСтр("ru = 'Все календари'");
		ФизЛицаКалендаря.ЗагрузитьЗначения(cbr_КалендарьСервер.ПолучитьПерсональнуюНастройку(
			"ТекущиеКалендариВсеКалендари"));
		Если ФизЛицаКалендаря.Количество() = 0 Тогда
			ФизЛицаКалендаря.Добавить(Пользователи.АвторизованныйПользователь());
		КонецЕсли;
		Элементы.ФизЛицаКалендаря.Видимость = Истина;
		Элементы.ФормаСоздатьЗанятость.Видимость = Ложь;
	ИначеЕсли Параметры.ВариантРаботыФормы = "КалендарьСотрудника" Тогда
		КлючНазначенияИспользования = "КалендарьСотрудника";
		Заголовок = СтрШаблон(НСтр("ru = 'Календарь сотрудника %1'"), Параметры.ФизЛицо);
		ФизЛицоКалендаря = Параметры.ФизЛицо;
		ФизЛицаКалендаря.Добавить(ФизЛицоКалендаря);
		Элементы.ФизЛицаКалендаря.Видимость = Ложь;
		Элементы.ФормаСоздатьЗанятость.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиОтображения()

	НастройкиОтображения.ФизЛица.Очистить();
	Для Каждого ОчередноеФизЛицо Из ФизЛицаКалендаря Цикл
		НастройкиОтображения.ФизЛица.Добавить(ОчередноеФизЛицо.Значение);
	КонецЦикла;
	Если ФизЛицаКалендаря.Количество() = 1 Тогда
		ФизЛицоКалендаря = ФизЛицаКалендаря[0].Значение;
	Иначе
		ФизЛицоКалендаря = Неопределено;
	КонецЕсли;
	НастройкиОтображения.ОтображаемаяДата = ОтображаемаяДата;
	НастройкиОтображения.ВыделенныеДаты = ВыделенныеДаты.ВыгрузитьЗначения();
	НастройкиОтображения.ПериодОтображения = ПериодОтображения;
	НастройкиОтображения.ОтображатьДействующиеЗадачи = ОтображатьДействуюшиеЗадачи;

	УстановитьТекущуюСтраницу(Элементы, ФизЛицаКалендаря, ПериодОтображения);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущуюСтраницу(Элементы, ФизЛицаКалендаря, ПериодОтображения)

	УказаныФизЛица = ФизЛицаКалендаря.Количество() <> 0;

	Если УказаныФизЛица И ПериодОтображения = ПредопределенноеЗначение(
		"Перечисление.cbr_ПериодОтображенияРабочегоКалендаря.ПланДня") Тогда
		Элементы.СтраницыПланировщика.ТекущаяСтраница = Элементы.СтраницаПланДня;
	ИначеЕсли УказаныФизЛица Тогда
		Элементы.СтраницыПланировщика.ТекущаяСтраница = Элементы.СтраницаПланировщик;
	Иначе
		Элементы.СтраницыПланировщика.ТекущаяСтраница = Элементы.СтраницаПусто;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	cbr_КалендарьСервер.УстановитьУсловноеОформлениеПланДня(УсловноеОформление);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьВыбораДаты()

	Элементы.ГруппаДата.Видимость = Не Элементы.ГруппаДата.Видимость;

КонецПроцедуры

#КонецОбласти
